// أولاً، يجب أن تعرف ما هي الهجرات التي لديك.

// يُعرض قائمة بجميع الترحيلات التي تم إنشاؤها 
Get-Migration 

/*
شرح
يطبق هذا الأمر عملية الترحيل المسماة YourMigrationName ويقوم بتحديث مخطط قاعدة البيانات ليتوافق مع عملية الترحيل هذه.
إذا كانت عملية الترحيل أحدث من حالة قاعدة البيانات الحالية، فإنه يطبق التغييرات.
إذا كانت عملية الترحيل أقدم من الحالة الحالية، فإنه يعود إلى عملية الترحيل هذه، ويتراجع عن جميع التغييرات اللاحقة.
*/

Update-DataBase YourMigrationName

/*
مثال
إذا كانت لديك عمليات الترحيل التالية:

20240101_InitialCreate
20240110_AddUsersTable
20240115_UpdateUserSchema
وكانت قاعدة البيانات الحالية لديك موجودة في 20240115_UpdateUserSchema، قم بتشغيل:
*/
Update-Database 20240110_AddUsersTable

// سيتم إرجاع قاعدة البيانات إلى هذا الترحيل، وإزالة التغييرات من 20240115_UpdateUserSchema.

// يُحدث قاعدة البيانات لتتماشى مع أحدث ترحيل
Update-DataBase

/*
يعمل هذا الأمر على إرجاع جميع عمليات الترحيل المطبقة وإعادة مخطط قاعدة البيانات إلى الحالة الأولية قبل تطبيق أي عمليات ترحيل.
وهذا يعني أن قاعدة البيانات الخاصة بك ستفقد جميع تغييرات المخطط التي تم إجراؤها بواسطة عمليات الترحيل، ولكنها لن تحذف البيانات ما لم تكن هناك تغييرات مدمرة.
*/

Update-DataBase -Migration:0 
